# 1
# 2
# 3
# 4
# 5 {}
# text = input('Введіть текст:')
# print(text * 5)
from dz3 import result

# 6


# # 7 {}
# name = input('Ваше ім`я:')
# print(f'Привіт, {name}!!!')

#  8
# zmtext = "Бійці 73-го центру ССО результативно мінують протоки навколо островів на Херсонському напрямку"
# zmuser = input("Введіть слово для пошуку: ")
#
# if zmtext

# #  9 {}
# bullet = int(input("Введіть кількість патронів, яку має з собою солдат:"))
# vorog = int(input("Введіть кількість ворожих солдатів:"))
# result = (bullet / 15) / vorog
# ost = bullet % vorog
# if result >= 1:
#     print(f"Патронів достатньо для знищення {vorog} ворожих солдатів, та залишиться ще {ost} патронів")
# else:
#     print('Нажаль такої кількості патронів не достатньо')

# #  10
# pal = int(input('Кількість палива:'))
# ros = int(input('Розхід палива на 100 км:'))
# dist = int(input('Відстань:'))
#
# rosdist = (dist * ros) / 100
#
# print('Палива вистачить!' if pal // rosdist >= 1 else 'Нажаль на цю дистанцію палива буде замало')


#  11
#  12