# 1 Змінна  - це ім'я якому присвоюється певна інформація
# 2 ні
# 3 Текст(рядок символів), число (ціле числове значення), Бул(True або False), плаваюче число (число з комою).
# 4 так
# 5
# text = input('Введіть текст:')
# number = int(input('Введіть число повторень тексту: '))
#
# print(text * number)
# #6
# numbers = int(input('Number:'))
# result = numbers * (-1)
# if numbers == 0:
#     print("Нуль не може бути від'ємним")
# else:
#     print(f"Тепер число має зворотнє значення: {result}")

# # 7 {}
# name = input('Ваше ім`я:')
# print(f'Привіт, {name}!!!')

# # 8
# zmtext = "Бійці 73-го центру ССО результативно мінують протоки навколо островів на Херсонському напрямку"
# zmuser = input("Введіть слово для пошуку: ")
#
# if zmuser in zmtext:
#     print('Вітаю, ваше слово присутнє в тексті')
# else:
#     print('Нажаль такого слова немає в тексті')

# #  9 {}
# bullet = int(input("Введіть кількість патронів, яку має з собою солдат:"))
# vorog = int(input("Введіть кількість ворожих солдатів:"))
# result = (bullet / 15) / vorog
# ost = bullet % vorog
# if result >= 1:
#     print(f"Патронів достатньо для знищення {vorog} ворожих солдатів, та залишиться ще {ost} патронів")
# else:
#     print('Нажаль такої кількості патронів не достатньо')

# #  10
# pal = int(input('Кількість палива:'))
# ros = int(input('Розхід палива на 100 км:'))
# dist = int(input('Відстань:'))
#
# rosdist = (dist * ros) / 100
#
# print('Палива вистачить!' if pal // rosdist >= 1 else 'Нажаль на цю дистанцію палива буде замало')


#  11

# txt = input("Введіть текст: ")
# match txt:
#     case 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 0:
#         print('У вашому тексті присутні цифри')
#     case _:
#         print('Відсутні цифри в тексті')


#  12

# txt = input('Text:')
# mas = len(txt)
# print(f'Кількість символів в тексті: {mas}')
# zr1 = int(input('Вкажіть початковий індекс видалення: '))
# zr2 = int(input('Вкажіть кінцевий індекс видаленя: '))
# print(f'Результат {txt[zr1:zr2]}')
# sym = int(input('Номер символа, що цікавить: '))
# print(f'Під цим номером символ {txt[sym]}')
# txtplus = input('Текст що треба додати:')
# print(f'Загальний текст: \n {txt}. {txtplus}')
